; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star10 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star6 - direction
	Star5 - direction
	Star8 - direction
	Star9 - direction
	GroundStation4 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star10)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star9)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet18)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star8)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 infrared1)
	(have_image Planet17 spectrograph0)
	(have_image Planet18 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 9
5. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 1 of 9
6. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 1 of 9
7. (take_image satellite0 planet12 instrument0 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon11 instrument0 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 9
12. (turn_to satellite0 planet15 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet15)
   goals met: 4 of 9
13. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 5 of 9
14. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 5 of 9
15. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 6 of 9
16. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 6 of 9
17. (take_image satellite0 planet17 instrument0 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 7 of 9
18. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 7 of 9
19. (take_image satellite0 planet18 instrument0 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 8 of 9
20. (turn_to satellite0 star6 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star6)
   goals met: 9 of 9
